Autodesk.Revit.UI.SelectionUIOptions.ElementSelectsAsPinned(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element)
Checks whether the specified element will be treated as pinned for the purposes of selection.
Remarks:
To improve usability, the option to disable pinned selection has some additional intelligence
beyond simply checking the pinned status.  For example, if a model group is pinned, the corresponding
attached detail group will also be treated as pinned for the purposes of selection.  If this method
returns true, the specified element will not be selectable when selection of pinned elements is
disabled.
document:
The document containing the element.
element:
The element to check.
Returns:
True if the specified element should be treated as pinned for selection purposes, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016